# Create Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellCombinedParameterData..::..Create Method
TableCellCombinedParameterData Class See Also
---
construct a TableCellCombinedParameterData
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static TableCellCombinedParameterData Create()
```

Visual Basic
---
```text
Public Shared Function Create As TableCellCombinedParameterData
```

Visual C++
---
```text
public:
static TableCellCombinedParameterData^ Create()
```

# See Also
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace